[
    {
        "tag": "状態遷移の整合性",
        "question": "この状態遷移図において、「認証中」から「認証完了」への遷移が失敗した場合の設計について、最も適切な指摘はどれか。",
        "choice": [
            "認証失敗時の遷移先が明示されておらず、エラーハンドリング設計が不足している",
            "認証失敗時は自動的に正常終了に遷移するため問題ない",
            "認証失敗は想定外のケースであり、設計上考慮不要である",
            "認証失敗時は使用中状態に直接遷移することで対応可能である"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "リスク分析",
        "question": "ATM機能が外部サービスに依存している場合、この状態遷移図から判断できる最大のリスクはどれか。",
        "choice": [
            "外部サービス障害時の状態遷移が定義されておらず、システムが滞留する可能性がある",
            "外部サービスは常に安定しているため、特にリスクは存在しない",
            "ATM機能は内部処理のみで完結するため、外部依存のリスクはない",
            "外部サービス障害時は自動的に待機中に戻るため問題ない"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "仕様変更の影響",
        "question": "新たに「認証完了後、使用中に入る前に利用規約同意が必要」という仕様変更が発生した場合、この図から判断できる影響範囲はどれか。",
        "choice": [
            "認証完了と使用中の間に新しい状態を追加する必要があり、関連する全ての遷移ロジックを見直す必要がある",
            "使用中状態内で規約同意を処理すれば良く、状態遷移図の変更は不要である",
            "認証中状態で同時に規約同意を処理すれば、図の変更は最小限で済む",
            "正常終了状態の前に規約同意を追加すれば、既存の遷移に影響はない"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "セッション管理",
        "question": "「使用中」状態で長時間操作がない場合のタイムアウト処理を実装する際、この図から判断できる適切な設計方針はどれか。",
        "choice": [
            "タイムアウト時の遷移先が図に明示されていないため、セキュリティ要件に基づき待機中または終了状態への遷移を新たに定義する必要がある",
            "タイムアウトは使用中状態内で完結するため、状態遷移図への影響はない",
            "タイムアウトは例外処理であり、正常終了として扱えば良い",
            "タイムアウト時は認証完了状態に戻すことで、再度使用中に入れる"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "依存関係の影響",
        "question": "認証機能が別のマイクロサービスとして分離されている場合、この状態遷移図から判断できる設計上の考慮事項はどれか。",
        "choice": [
            "認証サービスの応答遅延やタイムアウトが全体の状態遷移に影響するため、非同期処理や補償トランザクションの設計が必要である",
            "認証が分離されていても状態遷移は独立しているため、特別な考慮は不要である",
            "マイクロサービス化により認証中状態は不要になり、図を簡略化できる",
            "認証サービスの分離により、取引開始から認証完了まで直接遷移可能になる"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "例外処理の設計",
        "question": "「使用中」状態でシステムエラーが発生した場合、この図から判断できる適切な対応方針はどれか。",
        "choice": [
            "エラー発生時の遷移先が未定義であり、ロールバック処理や補償処理を含むエラー状態の追加が必要である",
            "システムエラーは想定外のため、そのまま正常終了として処理すべきである",
            "エラー時は認証中状態に戻すことで、ユーザーに再試行の機会を与えられる",
            "エラー時は待機中に戻すことで、初期状態から再開できる"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "状態の粒度設計",
        "question": "「使用中」状態が実際には複数のサブ処理（残高照会、出金、入金など）を含む場合、この図の抽象度について最も適切な評価はどれか。",
        "choice": [
            "使用中状態が粗粒度すぎる可能性があり、詳細な状態遷移を定義するか、別途サブ状態図が必要である",
            "使用中状態の粒度は適切であり、内部処理の詳細は実装レベルで対応すべきである",
            "すべてのサブ処理を同一状態で扱うことで、設計がシンプルになり保守性が向上する",
            "使用中状態は十分に詳細化されており、これ以上の分割は不要である"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "並行処理の考慮",
        "question": "同一ユーザーが複数のATMセッションを同時に開始しようとした場合、この図から判断できる設計上の課題はどれか。",
        "choice": [
            "並行セッションの制御に関する記述がなく、排他制御やセッション管理の仕組みを別途定義する必要がある",
            "各セッションは独立して待機中から開始できるため、特別な制御は不要である",
            "認証完了状態で自動的に他のセッションが終了するため問題ない",
            "使用中状態が排他制御を保証しているため、追加の設計は不要である"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "監査要件への対応",
        "question": "金融システムとして取引の監査ログが必要な場合、この状態遷移図から判断できる設計上の不足点はどれか。",
        "choice": [
            "各状態遷移時のログ記録ポイントや異常終了時の記録要件が明示されておらず、監査要件を満たす設計の追加が必要である",
            "正常終了状態があるため、そこでまとめてログを記録すれば監査要件を満たせる",
            "待機中状態で全ての操作を記録することで、監査要件に対応できる",
            "認証完了時点でログを記録すれば、以降の操作は追跡不要である"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "テスト設計の観点",
        "question": "この状態遷移図を基にテストケースを設計する際、最も優先して確認すべき項目はどれか。",
        "choice": [
            "各状態間の遷移パスを網羅するとともに、図に記載のない異常系遷移（認証失敗、タイムアウト等）の動作を確認する必要がある",
            "正常終了に至る一本道のパスのみを確認すれば、システムの品質は保証される",
            "待機中状態から各状態への直接遷移が可能かを確認することが最優先である",
            "使用中状態の滞在時間を測定することが、最も重要なテスト項目である"
        ],
        "authored_by": "claude",
        "is_translated": false
    }
]