[
    {
        "tag": "タイムアウト設計",
        "question": "認証中に60秒間操作がないとタイムアウトする設計について、ユーザー操作が{t2..t2+10}で行われる場合、開発者が最も注意すべきリスクはどれか。",
        "choice": [
            "t2がt+60を超える場合、ユーザー操作前にタイムアウトが発生する可能性がある",
            "60秒のタイムアウトは短すぎるため、必ず120秒以上に延長すべきである",
            "タイムアウト後は必ずエラー画面を表示する必要があるが図に記載がない",
            "ユーザー操作は10秒以内なので、タイムアウト設定との競合は発生しない"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "状態遷移の依存関係",
        "question": "「使用中」状態に到達するための依存関係を考慮した場合、システム障害により「認証中」状態で処理が停止した際、開発者が実装すべき最優先の対応はどれか。",
        "choice": [
            "「使用中」へ遷移できないため、適切なロールバック処理を実装する必要がある",
            "「使用中」状態を省略して直接「待機移行中」へ遷移させる仕組みが必要である",
            "認証中で停止しても自動的に使用中へ遷移するので特別な対応は不要である",
            "障害時は必ずシステム全体を再起動する設計とすれば問題は発生しない"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "例外処理設計",
        "question": "「待機移行中」という中間状態が存在する設計意図として、開発者が考慮すべき最も適切な理由はどれか。",
        "choice": [
            "リソースの解放やログ記録など、待機状態に戻る前の後処理を行うためである",
            "ユーザーに遷移アニメーションを見せるための演出用の状態として必要である",
            "システムの処理速度を意図的に遅くしてサーバー負荷を分散させるためである",
            "待機中と待機移行中は実質的に同じ状態なので設計上の冗長性に過ぎない"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "時間制約の影響",
        "question": "ユーザー操作が{t2..t2+10}という10秒間の範囲で行われる設計について、開発者が性能要件として確認すべき最も重要な項目はどれか。",
        "choice": [
            "10秒以内に完了すべき操作の種類や複雑さが仕様として定義されているか",
            "10秒という時間はユーザビリティ上短すぎるため必ず30秒以上とするべきか",
            "操作時間の範囲指定はシステムには不要なのでこの制約を削除できるか",
            "10秒間は必ず画面をロックしてユーザーの誤操作を防ぐべきかどうか"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "セキュリティ要件",
        "question": "SD認証が完了した後の「使用中」状態において、開発者がセキュリティ観点から実装すべき追加要件として最も適切なものはどれか。",
        "choice": [
            "使用中も定期的にセッションの有効性を検証し、タイムアウトを設定する仕組み",
            "使用中は認証を完全に解除してユーザーの利便性を最優先する仕組み",
            "SDカードを物理的に抜いても使用中状態を継続できるようにする仕組み",
            "使用中は他のユーザーも同時にログインできるようにする共有セッション"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "仕様変更の影響",
        "question": "タイムアウト時間を60秒から90秒に変更する仕様変更が発生した場合、開発者が影響範囲として確認すべき最も重要な項目はどれか。",
        "choice": [
            "ユーザー操作のタイミング{t2..t2+10}との整合性と他の状態遷移への影響",
            "90秒への変更は単純な定数変更なので影響範囲の確認は不要である",
            "タイムアウト時間の変更はデータベーススキーマの変更を必ず伴う",
            "60秒から90秒への変更は必ずユーザーインターフェースの再設計が必要"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "状態管理の実装",
        "question": "ATMの4つの状態（待機中、認証中、使用中、待機移行中）を実装する際、開発者が考慮すべき最も重要な設計原則はどれか。",
        "choice": [
            "各状態間の遷移条件を明確に定義し、不正な遷移を防ぐ状態機械を実装する",
            "全ての状態を同時に保持できるマルチステート設計を採用すべきである",
            "状態管理はクライアント側のみで完結させサーバー側では管理しない",
            "状態の種類を増やすことは複雑化するので2つの状態のみに簡略化する"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "リスク分析",
        "question": "時刻tで認証が開始され、t+60でタイムアウト、t2でユーザー操作という時系列設計において、最も深刻な競合状態リスクはどれか。",
        "choice": [
            "t2がt+60付近の場合、タイムアウトとユーザー操作が同時発生する可能性がある",
            "tとt2の間隔が長すぎる場合は必ずシステムがクラッシュする",
            "時刻の精度が秒単位なので必ずミリ秒単位に変更する必要がある",
            "競合状態は発生しないため排他制御の実装は一切不要である"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "ログ設計",
        "question": "このATMシステムのトラブルシューティングを効率化するため、開発者が実装すべき最も重要なログ出力項目はどれか。",
        "choice": [
            "各状態遷移の発生時刻、遷移元状態、遷移先状態、タイムアウトの発生有無",
            "ユーザーの個人情報を含む全ての操作履歴を無期限に保存する詳細ログ",
            "エラーが発生した場合のみログを記録し正常系では一切記録しない設計",
            "状態遷移は自明なのでログ出力は不要でシステムメトリクスのみ記録する"
        ],
        "authored_by": "claude",
        "is_translated": false
    },
    {
        "tag": "テスト戦略",
        "question": "この状態遷移図に基づいてテストケースを設計する際、開発者が最優先で実装すべきテストシナリオはどれか。",
        "choice": [
            "タイムアウト境界値とユーザー操作タイミングの組み合わせによる状態遷移テスト",
            "全ての状態を一度に遷移させる並行処理のストレステストのみ実施する",
            "ユーザー操作は必ず成功するという前提で正常系のみをテストすればよい",
            "状態遷移図は完全なので実機テストは不要でコードレビューのみで十分"
        ],
        "authored_by": "claude",
        "is_translated": false
    }
]